import React, { useState } from 'react';

const topicsList = [
    "Спорт", "Футбол", "Баскетбол", "Теніс", "Бокс", "Хокей", "Формула-1", "ММА", "Йога", "Екстремальні види спорту", "Програмування",
    "Технології", "Мобільні технології","Штучний інтелект", "Кібербезпека","Веб-розробка", "Робототехніка","Веб-дизайн", 
    "Віртуальна реальність", "Ігрові технології", "Мистецтво", "Живопис", "Скульптура", "Фотографія", "Музика", "Поп-музика", "Класична музика",
    "Рок-музика", "Джаз", "Електронна музика","Подорожі", "Підводний світ","Сафарі", "Круїзи",
    "Кулінарія", "Рецепти", "Веганські страви", "Молекулярна кухня", "Національні кухні", "Здоров'я", "Фітнес", "Дієти та харчування", "Медитація",
    "Альтернативна медицина", "Кіно", "Комедії", "Драми", "Фантастика", "Документальне кіно", "Короткометражки", "Книги", "Фантастика",
    "Детективи", "Історичні романи", "Поезія", "Наука", "Космос", "Біотехнології", "Генетика", "Екологія", "Фізика", "Хімія", "Астрономія",
    "Політика", "Світова політика","Дипломатія", "Соціальна політика", "Бізнес", "Маркетинг", "Підприємництво", "Фінанси",
    "Інвестиції", "Стратегії росту", "Мода", "Тренди", "Взуття та аксесуари", "Етична мода", "Історія", "Антична історія", "Середньовіччя",
    "Друга світова війна", "Ренесанс", "Культура корінних народів", "Відеоігри", "Шутери", "Рольові ігри", "Стратегії", "Карткові ігри", "Меми",
    "Освіта", "Самоосвіта", "Онлайн-курси", "Викладання", "Дитячий розвиток","Криптовалюти", "Біткоїн", "Ефіріум", 
    "NFT", "Майнінг", "Крипто-новини", "Аналіз криптовалют","Ставки", "Спортивні ставки", "Казино", "Онлайн-ставки", "Покер", "Блекджек", 
    "Рулетка", "Ігри на гроші", "Тоталізатор", "Фінансові ставки","Блогінг", "SEO", "Контент-маркетинг", "СММ", "Написання статей", "Репортажі", 
    "YouTube", "Instagram", "TikTok","Платформи для блогів", "Монетизація блогів",
    "Підвищення трафіку", "Аналіз аудиторії", "Реклама в блозі", "Стратегії контенту","Написання книг", 
    "Мотивація для блогерів","Блогери", "Розвиток особистого бренду", "Копірайтинг","Інтерв'ю з блогерами",
    "Фриланс", "Дистанційна робота", "Кар'єра в блогінгу"
];

const CommunitySearchByTopic = ({ onSearchByTopic }) => {
    const [selectedTopic, setSelectedTopic] = useState('');

    const handleTopicChange = (e) => {
        const value = e.target.value;
        setSelectedTopic(value);
        onSearchByTopic(value); // Викликаємо фільтрацію спільнот за темою
    };

    return (
        <div className="topic-selector-conteiner">
            <select value={selectedTopic} onChange={handleTopicChange}>
                <option value="">Оберіть тему</option>
                {topicsList.map((topic, index) => (
                    <option key={index} value={topic}>
                        {topic}
                    </option>
                ))}
            </select>
        </div>
    );
};

export default CommunitySearchByTopic;

